Revit 2027 API
GroupTypeId.AnalyticalModel Property
 Analytical Model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModel { get; }
Public Shared ReadOnly Property AnalyticalModel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModel {
	ForgeTypeId^ get ();
}
static member AnalyticalModel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
GroupTypeId Class
Autodesk.Revit.DB Namespace